In [3]:
library(tidyverse)

── Attaching core tidyverse packages ──────────────────────── tidyverse 2.0.0 ──
✔ dplyr     1.1.4     ✔ readr     2.1.5
✔ forcats   1.0.0     ✔ stringr   1.5.1
✔ ggplot2   3.5.2     ✔ tibble    3.2.1
✔ lubridate 1.9.4     ✔ tidyr     1.3.1
✔ purrr     1.0.4
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors

In [45]:
students = tibble(id = 1:5,
                   name = c("Ann", "Ben", "Cathy", "Dan", "Eva"),
                   math = c(78, 92, 85, 66, 88),
                   english = c(70, 85, 90, 75, 80),
                   passed = c(TRUE, TRUE, TRUE, FALSE, TRUE))

students

  id name  math english passed
1 1  Ann   78   70       TRUE
2 2  Ben   92   85       TRUE
3 3  Cathy 85   90       TRUE
4 4  Dan   66   75      FALSE
5 5  Eva   88   80       TRUE

In [53]:
students %>% select(name, math)

  name  math
1 Ann   78
2 Ben   92
3 Cathy 85
4 Dan   66
5 Eva   88

In [55]:
students %>% select(-id)

  name  math english passed
1 Ann   78   70       TRUE
2 Ben   92   85       TRUE
3 Cathy 85   90       TRUE
4 Dan   66   75      FALSE
5 Eva   88   80       TRUE

In [57]:
students %>% filter(math > 80)

  id name  math english passed
1 2  Ben   92   85      TRUE
2 3  Cathy 85   90      TRUE
3 5  Eva   88   80      TRUE

In [59]:
students %>% filter(math > 80 & english < 90)

  id name math english passed
1 2  Ben  92   85      TRUE
2 5  Eva  88   80      TRUE

In [61]:
students %>% filter(math > 80 | passed == FALSE)

  id name  math english passed
1 2  Ben   92   85       TRUE
2 3  Cathy 85   90       TRUE
3 4  Dan   66   75      FALSE
4 5  Eva   88   80       TRUE

In [63]:
students %>% filter(math > 80) %>% select(name, math)

  name  math
1 Ben   92
2 Cathy 85
3 Eva   88

In [65]:
# Exercise
# 1. Show students with english > 80
# 2. Show students with math + english > 170
# 3. Only show 'name' and 'passed'

students %>% filter(english > 80)

students %>% filter(english + math > 170)

students %>% select(name, passed)

  id name  math english passed
1 2  Ben   92   85      TRUE
2 3  Cathy 85   90      TRUE

  id name  math english passed
1 2  Ben   92   85      TRUE
2 3  Cathy 85   90      TRUE

  name  passed
1 Ann    TRUE
2 Ben    TRUE
3 Cathy  TRUE
4 Dan   FALSE
5 Eva    TRUE

In [67]:
students %>% mutate(avg_score = (math + english)/2)

  id name  math english passed avg_score
1 1  Ann   78   70       TRUE  74.0
2 2  Ben   92   85       TRUE  88.5
3 3  Cathy 85   90       TRUE  87.5
4 4  Dan   66   75      FALSE  70.5
5 5  Eva   88   80       TRUE  84.0

In [69]:
students %>% mutate(status = ifelse(passed == TRUE, 'Passed', 'Failed'))

  id name  math english passed status
1 1  Ann   78   70       TRUE  Passed
2 2  Ben   92   85       TRUE  Passed
3 3  Cathy 85   90       TRUE  Passed
4 4  Dan   66   75      FALSE  Failed
5 5  Eva   88   80       TRUE  Passed

In [71]:
students %>% mutate(avg_score = (math + english) / 2,
                    grade = ifelse(avg_score >= 90, 'A',
                                   ifelse(avg_score >= 80, 'B', 'C')))

  id name  math english passed avg_score grade
1 1  Ann   78   70       TRUE  74.0      C
2 2  Ben   92   85       TRUE  88.5      B
3 3  Cathy 85   90       TRUE  87.5      B
4 4  Dan   66   75      FALSE  70.5      C
5 5  Eva   88   80       TRUE  84.0      B

In [77]:
students %>% arrange(math)

students %>% arrange(desc(english))

students %>% arrange(desc(passed), desc(english))

  id name  math english passed
1 4  Dan   66   75      FALSE
2 1  Ann   78   70       TRUE
3 3  Cathy 85   90       TRUE
4 5  Eva   88   80       TRUE
5 2  Ben   92   85       TRUE

  id name  math english passed
1 3  Cathy 85   90       TRUE
2 2  Ben   92   85       TRUE
3 5  Eva   88   80       TRUE
4 4  Dan   66   75      FALSE
5 1  Ann   78   70       TRUE

  id name  math english passed
1 3  Cathy 85   90       TRUE
2 2  Ben   92   85       TRUE
3 5  Eva   88   80       TRUE
4 1  Ann   78   70       TRUE
5 4  Dan   66   75      FALSE

In [89]:
# Exercise
# 1. Arrnage based on avg_score from highest score to least
# 2. Arrange based passed then avg_score
# 3. Arrange based on grade.

students %>% mutate(avg_score = (math + english)/2) %>% arrange(desc(avg_score))

students %>% mutate(avg_score = (math + english)/2) %>% arrange(desc(passed), desc(avg_score))

students %>% mutate(avg_score = (math + english)/2, 
                    grade = ifelse(avg_score > 85, 'A', 
                                   ifelse(avg_score > 80, 'B', 'C'))) %>% arrange(grade)

  id name  math english passed avg_score
1 2  Ben   92   85       TRUE  88.5
2 3  Cathy 85   90       TRUE  87.5
3 5  Eva   88   80       TRUE  84.0
4 1  Ann   78   70       TRUE  74.0
5 4  Dan   66   75      FALSE  70.5

  id name  math english passed avg_score
1 2  Ben   92   85       TRUE  88.5
2 3  Cathy 85   90       TRUE  87.5
3 5  Eva   88   80       TRUE  84.0
4 1  Ann   78   70       TRUE  74.0
5 4  Dan   66   75      FALSE  70.5

  id name  math english passed avg_score grade
1 2  Ben   92   85       TRUE  88.5      A
2 3  Cathy 85   90       TRUE  87.5      A
3 5  Eva   88   80       TRUE  84.0      B
4 1  Ann   78   70       TRUE  74.0      C
5 4  Dan   66   75      FALSE  70.5      C